RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_i2c.c
/*********************************************************************************************************//**
 * @file    ht32f5xxxx_i2c.c
 * @version $Rev:: 6398         $
 * @date    $Date:: 2022-10-27 #$
 * @brief   This file provides all the I2C firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f5xxxx_i2c.h"

/** @addtogroup HT32F5xxxx_Peripheral_Driver HT32F5xxxx Peripheral Driver
  * @{
  */

/** @defgroup I2C I2C
  * @brief I2C driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup I2C_Private_Define I2C private definitions
  * @{
  */
/* I2C ENI2C mask                                                                                           */
#define CR_ENI2C_SET             ((u32)0x00000008)
#define CR_ENI2C_RESET           ((u32)0xFFFFFFF7)

/* I2C ENGC mask                                                                                            */
#define CR_ENGC_SET              ((u32)0x00000004)
#define CR_ENGC_RESET            ((u32)0xFFFFFFFB)

/* I2C AA mask                                                                                              */
#define CR_ACK_SET               ((u32)0x00000001)
#define CR_ACK_RESET             ((u32)0xFFFFFFFE)

/* I2C PDMANACK mask                                                                                        */
#define CR_PDMANACK_SET          ((u32)0x00000400)
#define CR_PDMANACK_RESET        ((u32)0xFFFFFBFF)

/* I2C ENTOUT mask                                                                                          */
#define CR_ENTOUT_SET            ((u32)0x00001000)
#define CR_ENTOUT_RESET          ((u32)0xFFFFEFFF)

/* I2C COMBFILT mask                                                                                        */
#define CR_COMBFILTER_SET        ((u32)0x00002000)
#define CR_COMBFILTER_RESET      ((u32)0xFFFFDFFF)

/* I2C Device Address 0 and Device Address 1 mask                                                           */
#define ADDR_DEVADDR0_SET        ((u32)0x00008000)
#define ADDR_DEVADDR0_RESET      ((u32)0xFFFF7FFF)
#define ADDR_DEVADDR1_SET        ((u32)0x80000000)
#define ADDR_DEVADDR1_RESET      ((u32)0x7FFFFFFF)

/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @defgroup I2C_Exported_Functions I2C exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the I2C peripheral registers to their default reset values.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @retval None
 ************************************************************************************************************/
void I2C_DeInit(HT_I2C_TypeDef* I2Cx)
{
  RSTCU_PeripReset_TypeDef RSTCUReset = {{0}};

  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));

  if (I2Cx == HT_I2C0)
  {
    RSTCUReset.Bit.I2C0 = 1;
  }
  #if (LIBCFG_I2C1)
  else if (I2Cx == HT_I2C1)
  {
    RSTCUReset.Bit.I2C1 = 1;
  }
  #endif
  #if (LIBCFG_I2C2)
  else if (I2Cx == HT_I2C2)
  {
    RSTCUReset.Bit.I2C2 = 1;
  }
  #endif

  RSTCU_PeripReset(RSTCUReset, ENABLE);
}

/*********************************************************************************************************//**
 * @brief Initialize the I2Cx peripheral according to the specified parameters in the I2C_InitStruct.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_InitStruct: pointer to a I2C_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void I2C_Init(HT_I2C_TypeDef* I2Cx, I2C_InitTypeDef* I2C_InitStruct)
{
  u32 PCLK_Freq = 0;
  s32 sTmp = 0;
  s32 SHPGR = 0;
  s32 SLPGR = 0;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_GENERAL_CALL(I2C_InitStruct->I2C_GeneralCall));
  Assert_Param(IS_I2C_ACKNOWLEDGE_ADDRESS(I2C_InitStruct->I2C_AddressingMode));
  Assert_Param(IS_I2C_ACKNOWLEDGE(I2C_InitStruct->I2C_Acknowledge));
  Assert_Param(IS_I2C_ADDRESS(I2C_InitStruct->I2C_OwnAddress));
  Assert_Param(IS_I2C_SPEED(I2C_InitStruct->I2C_Speed));

  #if (LIBCFG_I2C_NO_10BIT_MODE)
  I2Cx->CR = (I2Cx->CR & 0xFFFFFFFA) | I2C_InitStruct->I2C_GeneralCall | I2C_InitStruct->I2C_Acknowledge;
  #else
  I2Cx->CR = (I2Cx->CR & 0xFFFFFF7A) | I2C_InitStruct->I2C_GeneralCall |
             I2C_InitStruct->I2C_AddressingMode | I2C_InitStruct->I2C_Acknowledge;
  #endif

  #if (LIBCFG_I2C_TWO_DEV_ADDR)
  I2Cx->ADDR = (I2Cx->ADDR & 0xFFFF0000) | (ADDR_DEVADDR0_SET | (I2C_InitStruct->I2C_OwnAddress));
  #else
  I2Cx->ADDR = I2C_InitStruct->I2C_OwnAddress;
  #endif

  if (I2Cx == HT_I2C0)
    PCLK_Freq = CKCU_GetPeripFrequency(CKCU_PCLK_I2C0);
  #if (LIBCFG_I2C1)
  else if (I2Cx == HT_I2C1)
    PCLK_Freq = CKCU_GetPeripFrequency(CKCU_PCLK_I2C1);
  #endif
  #if (LIBCFG_I2C2)
  else if (I2Cx == HT_I2C2)
    PCLK_Freq = CKCU_GetPeripFrequency(CKCU_PCLK_I2C2);
  #endif

  switch (I2Cx->CR & 0xC000)
  {
    case 0:
    {
      sTmp = 6;
      break;
    }
    case 0x4000:
    {
      sTmp = 8;
      break;
    }
    case 0x8000:
    {
      sTmp = 9;
      break;
    }
  }

  SHPGR = (PCLK_Freq * 9)/(I2C_InitStruct->I2C_Speed * 20) - sTmp - I2C_InitStruct->I2C_SpeedOffset;
  SLPGR = (PCLK_Freq * 11)/(I2C_InitStruct->I2C_Speed * 20) - sTmp - I2C_InitStruct->I2C_SpeedOffset;

  SHPGR = (SHPGR < 0) ? 0 : SHPGR;
  SLPGR = (SLPGR < 0) ? 0 : SLPGR;

  I2Cx->SHPGR = SHPGR;
  I2Cx->SLPGR = SLPGR;
}

