RT-Thread/rt-thread/bsp/ht32/libraries/HT32_STD_5xxxx_FWLib/library/HT32F5xxxx_Driver/src/ht32f5xxxx_i2c.c
/*********************************************************************************************************//**
 * @brief Fill each I2C_InitStruct member with its default value.
 * @param I2C_InitStruct: pointer to an I2C_InitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void I2C_StructInit(I2C_InitTypeDef* I2C_InitStruct)
{
  I2C_InitStruct->I2C_GeneralCall = I2C_GENERALCALL_DISABLE;
  I2C_InitStruct->I2C_AddressingMode = I2C_ADDRESSING_7BIT;
  I2C_InitStruct->I2C_Acknowledge = I2C_ACK_DISABLE;
  I2C_InitStruct->I2C_OwnAddress = 0;
  I2C_InitStruct->I2C_Speed = 1000000;
  I2C_InitStruct->I2C_SpeedOffset = 0;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified I2C peripheral.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_Cmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_ENI2C_SET;
  }
  else
  {
    I2Cx->CR &= CR_ENI2C_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Generate STOP condition of I2C communication.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @retval None
 ************************************************************************************************************/
void I2C_GenerateSTOP(HT_I2C_TypeDef* I2Cx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));

  I2Cx->CR |= 0x2;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable I2C interrupts.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Int: specify if the I2C interrupt source to be enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg I2C_INT_STA
 *     @arg I2C_INT_STO
 *     @arg I2C_INT_ADRS
 *     @arg I2C_INT_GCS
 *     @arg I2C_INT_ARBLOS
 *     @arg I2C_INT_RXNACK
 *     @arg I2C_INT_BUSERR
 *     @arg I2C_INT_TOUT
 *     @arg I2C_INT_RXDNE
 *     @arg I2C_INT_TXDE
 *     @arg I2C_INT_RXBF
 *     @arg I2C_INT_ALL
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_IntConfig(HT_I2C_TypeDef* I2Cx, u32 I2C_Int, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_INT(I2C_Int));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->IER |= I2C_Int;
  }
   else
  {
    I2Cx->IER &= (u32)~I2C_Int;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable I2C General Call.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_GeneralCallCmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_ENGC_SET;
  }
  else
  {
    I2Cx->CR &= CR_ENGC_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable I2C sending acknowledgement.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void I2C_AckCmd(HT_I2C_TypeDef* I2Cx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    I2Cx->CR |= CR_ACK_SET;
  }
  else
  {
    I2Cx->CR &= CR_ACK_RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Configure own address of the specified I2C.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Address: specify own address of I2C.
 * @retval None
 ************************************************************************************************************/
void I2C_SetOwnAddress(HT_I2C_TypeDef* I2Cx, I2C_AddressTypeDef I2C_Address)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_ADDRESS(I2C_Address));

  #if (LIBCFG_I2C_TWO_DEV_ADDR)
  I2Cx->ADDR = (I2Cx->ADDR & 0xFFFFFF80) | (ADDR_DEVADDR0_SET | I2C_Address);
  #else
  I2Cx->ADDR = I2C_Address;
  #endif
}

#if (LIBCFG_I2C_TWO_DEV_ADDR)
/*********************************************************************************************************//**
 * @brief Configure own address 1 of the specified I2C.
 * @param I2Cx: where I2Cx is the selected I2C from the I2C peripherals.
 * @param I2C_Address: specify own address 1 of I2C.
 * @retval None
 ************************************************************************************************************/
void I2C_SetOwnAddress1(HT_I2C_TypeDef* I2Cx, I2C_AddressTypeDef I2C_Address)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_I2C(I2Cx));
  Assert_Param(IS_I2C_ADDRESS(I2C_Address));

